In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import re

In [4]:
data = {"dave" : "dave@naver.com", 'kgt' : 'kgt0813@gmail.com', 'kim' : 'kim@yahoo.com'}

In [5]:
data = pd.Series(data)

In [6]:
data

dave       dave@naver.com
kgt     kgt0813@gmail.com
kim         kim@yahoo.com
dtype: object

In [7]:
data.str.contains('k')

dave    False
kgt      True
kim      True
dtype: bool

In [9]:
data.str.get(1)

dave    a
kgt     g
kim     i
dtype: object

In [10]:
data.str[:5]

dave    dave@
kgt     kgt08
kim     kim@y
dtype: object

In [11]:
# 데이터 준비하기 : 조인 병합 변형

In [12]:
data = pd.Series(np.random.randn(9),
                index = [['a', 'a', 'a', 'b', 'b', 'c' ,'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [13]:
data

a  1   -0.394277
   2   -1.027010
   3    0.451256
b  1    0.709189
   3    0.348735
c  1   -2.420802
   2   -0.495591
d  2   -1.139163
   3    0.915865
dtype: float64

In [14]:
data.index #level이 a,b,c,d 4개로 이루어져 있고

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [15]:
data['b']

1    0.709189
3    0.348735
dtype: float64

In [18]:
data.loc[['b', 'd']]

b  1    0.709189
   3    0.348735
d  2   -1.139163
   3    0.915865
dtype: float64

In [19]:
data.unstack()

          1         2         3
a -0.394277 -1.027010  0.451256
b  0.709189       NaN  0.348735
c -2.420802 -0.495591       NaN
d       NaN -1.139163  0.915865

In [22]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                              columns = [['ohio', 'ohio', 'colorado'],
                                        ['green', 'red', 'green']])

In [23]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [24]:
frame.index.names = ['key1' ,'key2']

In [25]:
frame.columns.names = ['state' , 'color']

In [26]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [27]:
frame['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [28]:
#계층의 순서를 바꾸고 정렬하기

In [30]:
frame.swaplevel('key1' ,'key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [31]:
frame.sort_index(level = 1)

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [33]:
frame.swaplevel(0, 1).sort_index( level = 0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [34]:
# 계층별 요약 통계

In [35]:
frame.sum(level = 'key2')

C:\Users\KO\AppData\Local\Temp/ipykernel_61360/958648635.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = 'key2')

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [38]:
frame.sum(level = 'color', axis = 1).sort_index(axis = 0)

C:\Users\KO\AppData\Local\Temp/ipykernel_61360/2764799411.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = 'color', axis = 1).sort_index(axis = 0)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [39]:
frame = pd.DataFrame({'a' : range(7), 'b' : range(7, 0, -1),
                     'c' : ['one', 'one' ,'one' ,'two', 'two', 'two', 'two'],
                     'd' : [0,1, 2, 0, 1, 2, 3]})

In [40]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [41]:
frame2 = frame.set_index(['c', 'd'])

In [42]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [43]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [44]:
# 데이터 합치기

In [45]:
df1 = pd.DataFrame({'key' : ['b', 'b', 'a', 'c' ,'a', 'a', 'b'],
                   'data1' : range(7)})

In [46]:
df2 = pd.DataFrame({'key' : ['a', 'b', 'd'],
                   'data2' : range(3)})

In [47]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [48]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [52]:
df1.sort_values(by = df1.columns[0])

  key  data1
2   a      2
4   a      4
5   a      5
0   b      0
1   b      1
6   b      6
3   c      3

In [53]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [54]:
pd.merge(df1, df2, how = 'right')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   d    NaN      2

In [55]:
left1 = pd.DataFrame({'key' : ['a', 'b', 'a', 'a', 'b', 'c'],
                     'value' : range(6)})
right1 = pd.DataFrame({'group_val' : [3.5, 7]}, index = ['a', 'b'])

In [56]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [57]:
right1

   group_val
a        3.5
b        7.0

In [61]:
pd.merge(left1, right1, left_on = 'key', right_index = True, how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [62]:
arr = np.arange(12).reshape((3,4))

In [64]:
np.concatenate([arr, arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [65]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
             index = ['f', 'e', 'd', 'c', 'b', 'a'])

In [66]:
b = pd.Series(np.arange(len(a), dtype = np.float64),
             index = ['f', 'e', 'd', 'c', 'b', 'a'])

In [67]:
a,b

(f    NaN
 e    2.5
 d    NaN
 c    3.5
 b    4.5
 a    NaN
 dtype: float64,
 f    0.0
 e    1.0
 d    2.0
 c    3.0
 b    4.0
 a    5.0
 dtype: float64)

In [68]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index = pd.Index(['ohio', 'colorado'],
                                   name = 'state'),
                   columns = pd.Index(['one', 'two', 'three'],
                                     name = 'number'))

In [69]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [70]:
data.stack()

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [71]:
data.unstack()

number  state
one     ohio        0
        colorado    3
two     ohio        1
        colorado    4
three   ohio        2
        colorado    5
dtype: int32

In [72]:
result = data.stack()

In [73]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [74]:
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [75]:
result.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5